In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
################ where ####################


csv_data = pd.DataFrame({"a":[1,4],"b":[2.0,5.1],"string":["ﾎｹﾞ","ﾋｹﾞ"]})

def hoge(data):
    if data[0]+data[1]>5:
        return 1
    else:
        return 0


csv_data["c"]= csv_data[["a","b"]].apply(hoge,axis=1)

In [4]:
df = pd.read_csv('sample.csv')
df = df.set_index('time')
df_with_cnd = df.where(df < 0)
df_with_cnd = df.where(df < 0,100)

df.where(df < 0,100,inplace = True)

In [5]:
df = pd.read_csv('input/sample1.csv')
df = df.set_index('time')
print(df)
print("^^^^^^^^^^^^")
ite = df.iteritems()
for elem in ite:
    print(elem)

                     1  2  3  4  5    a    b   c   d     e
time
2016-10-17 00:00:01  1  2  3  2  1  1.5  aaa   0   0   NaN
2016-10-17 00:00:02  4  5  6  5  4  NaN    1   2   3   4.0
2016-10-17 00:00:03  7  8  9  8  7  8.0    9  10  11  12.0
^^^^^^^^^^^^
('1', time
2016-10-17 00:00:01    1
2016-10-17 00:00:02    4
2016-10-17 00:00:03    7
Name: 1, dtype: int64)
('2', time
2016-10-17 00:00:01    2
2016-10-17 00:00:02    5
2016-10-17 00:00:03    8
Name: 2, dtype: int64)
('3', time
2016-10-17 00:00:01    3
2016-10-17 00:00:02    6
2016-10-17 00:00:03    9
Name: 3, dtype: int64)
('4', time
2016-10-17 00:00:01    2
2016-10-17 00:00:02    5
2016-10-17 00:00:03    8
Name: 4, dtype: int64)
('5', time
2016-10-17 00:00:01    1
2016-10-17 00:00:02    4
2016-10-17 00:00:03    7
Name: 5, dtype: int64)
('a', time
2016-10-17 00:00:01    1.5
2016-10-17 00:00:02    NaN
2016-10-17 00:00:03    8.0
Name: a, dtype: float64)
('b', time
2016-10-17 00:00:01    aaa
2016-10-17 00:00:02      1
2016-10-17 00:00:03      9
Name: b, dtype: object)
('c', time
2016-10-17 00:00:01     0
2016-10-17 00:00:02     2
2016-10-17 00:00:03    10
Name: c, dtype: int64)
('d', time
2016-10-17 00:00:01     0
2016-10-17 00:00:02     3
2016-10-17 00:00:03    11
Name: d, dtype: int64)
('e', time
2016-10-17 00:00:01     NaN
2016-10-17 00:00:02     4.0
2016-10-17 00:00:03    12.0
Name: e, dtype: float64)

In [6]:
################ loc ####################

df = pd.read_csv('input/sample1.csv')
df = df.set_index('time')
df.loc[['2016-10-17 00:00:01','2016-10-17 00:00:03'],["1","2"]]
df.loc['2016-10-17 00:00:01':'2016-10-17 00:00:03',"1":"4"]

                     1  2  3  4
time
2016-10-17 00:00:01  1  2  3  2
2016-10-17 00:00:02  4  5  6  5
2016-10-17 00:00:03  7  8  9  8

In [7]:


df = pd.read_csv('input/sample2.csv')
df = df.set_index('time')
df.loc[['2016-10-17 00:00:01','2016-10-17 00:00:03'],["1","2"]]
df.drop_duplicates(inplace=True)
df.loc['2016-10-17 00:00:01':'2016-10-17 00:00:03 ','1':'e']

                     1  2  3  4  5    a    b   c   d     e
time
2016-10-17 00:00:01  1  2  3  2  1  1.5  aaa   0   0   NaN
2016-10-17 00:00:02  4  5  6  5  4  NaN    1   2   3   4.0
2016-10-17 00:00:03  7  8  9  8  7  8.0    9  10  11  12.0

In [8]:
################ add ####################

df = pd.read_csv('input/sample1.csv')
df = df.set_index('time')
df.ix[0,0]

/Users/kenji_tachibana/.pyenv/versions/anaconda3-4.3.0/lib/python3.6/site-packages/ipykernel_launcher.py:3: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  This is separate from the ipykernel package so we can avoid doing imports until

1

In [9]:
df = pd.DataFrame(np.arange(0,30).reshape(6,5),index = list("ASDFGH"), columns = list("abcde"))

In [10]:
s1 = pd.Series(range(6), index=list("abcdef"))
s2 = pd.Series([10,20,30,40,50], index=list("asdfg"))


s1.add(s2,fill_value=0)

a    10.0
b     1.0
c     2.0
d    33.0
e     4.0
f    45.0
g    50.0
s    20.0
dtype: float64

In [11]:
df1 = pd.DataFrame(np.arange(0,30).reshape((6,5)), index=list("ASDFGH"), columns=list("abcde"))
df2 = pd.DataFrame(np.arange(0,42).reshape((7,6)), index=list("ASDFGHJ"), columns=list("abcdef"))
df1

    a   b   c   d   e
A   0   1   2   3   4
S   5   6   7   8   9
D  10  11  12  13  14
F  15  16  17  18  19
G  20  21  22  23  24
H  25  26  27  28  29

In [12]:
df2

    a   b   c   d   e   f
A   0   1   2   3   4   5
S   6   7   8   9  10  11
D  12  13  14  15  16  17
F  18  19  20  21  22  23
G  24  25  26  27  28  29
H  30  31  32  33  34  35
J  36  37  38  39  40  41

In [13]:
df1+df2

      a     b     c     d     e   f
A   0.0   2.0   4.0   6.0   8.0 NaN
D  22.0  24.0  26.0  28.0  30.0 NaN
F  33.0  35.0  37.0  39.0  41.0 NaN
G  44.0  46.0  48.0  50.0  52.0 NaN
H  55.0  57.0  59.0  61.0  63.0 NaN
J   NaN   NaN   NaN   NaN   NaN NaN
S  11.0  13.0  15.0  17.0  19.0 NaN

In [14]:
############### add fill_value を入れると０で保管して計算する　#####################
df1.add(df2,fill_value=0)

      a     b     c     d     e     f
A   0.0   2.0   4.0   6.0   8.0   5.0
D  22.0  24.0  26.0  28.0  30.0  17.0
F  33.0  35.0  37.0  39.0  41.0  23.0
G  44.0  46.0  48.0  50.0  52.0  29.0
H  55.0  57.0  59.0  61.0  63.0  35.0
J  36.0  37.0  38.0  39.0  40.0  41.0
S  11.0  13.0  15.0  17.0  19.0  11.0

In [15]:
s = pd.Series(range(10), index=[list("aaabbbccdd"),[1,2,3,2,1,3,1,2,1,2]])

In [16]:
s[:,1]

a    0
b    4
c    6
d    8
dtype: int64

In [17]:
##############　スワップ　######################
s.swaplevel(0,1)

1  a    0
2  a    1
3  a    2
2  b    3
1  b    4
3  b    5
1  c    6
2  c    7
1  d    8
2  d    9
dtype: int64

In [18]:
s.unstack()

     1    2    3
a  0.0  1.0  2.0
b  4.0  3.0  5.0
c  6.0  7.0  NaN
d  8.0  9.0  NaN

In [19]:
df.stack()

A  a     0
   b     1
   c     2
   d     3
   e     4
S  a     5
   b     6
   c     7
   d     8
   e     9
D  a    10
   b    11
   c    12
   d    13
   e    14
F  a    15
   b    16
   c    17
   d    18
   e    19
G  a    20
   b    21
   c    22
   d    23
   e    24
H  a    25
   b    26
   c    27
   d    28
   e    29
dtype: int64

In [20]:
################ rename ####################
df.rename(index={"A":"a","S":"s"},columns={"a":"A","b":"B"})

    A   B   c   d   e
a   0   1   2   3   4
s   5   6   7   8   9
D  10  11  12  13  14
F  15  16  17  18  19
G  20  21  22  23  24
H  25  26  27  28  29

In [48]:
################ 離散化 ####################
df = pd.DataFrame([[20,"F"],[22,"M"],[25,"M"],[27,"M"],[21,"F"],[23,"M"],[37,"F"],[31,"M"],[61,"F"],[45,"M"],[41,"F"],[32,"M"]], columns=["age", "sex"])
bins = [18,25,35,60,100]
group_names = ["youth","young_adult","middle_age","senior"]
df["bins"] = pd.cut(df["age"],bins,labels=group_names)

In [49]:
df

    age sex         bins
0    20   F        youth
1    22   M        youth
2    25   M        youth
3    27   M  young_adult
4    21   F        youth
5    23   M        youth
6    37   F   middle_age
7    31   M  young_adult
8    61   F       senior
9    45   M   middle_age
10   41   F   middle_age
11   32   M  young_adult

In [50]:
df.set_index("bins")

             age sex
bins
youth         20   F
youth         22   M
youth         25   M
young_adult   27   M
youth         21   F
youth         23   M
middle_age    37   F
young_adult   31   M
senior        61   F
middle_age    45   M
middle_age    41   F
young_adult   32   M

In [51]:
df.sort_values(list(df.columns.values)).set_index(["bins","sex"])

                 age
bins        sex
youth       F     20
            F     21
            M     22
            M     23
            M     25
young_adult M     27
            M     31
            M     32
middle_age  F     37
            F     41
            M     45
senior      F     61

In [26]:
################ takeによるサンプリング　####################
df = pd.DataFrame([[20,"F"],[22,"M"],[25,"M"],[27,"M"],[21,"F"],[23,"M"],[37,"F"],[31,"M"],[61,"F"],[45,"M"],[41,"F"],[32,"M"]], columns=["age", "sex"])

sampler =   np.random.permutation(len(df))
sampler

array([ 1,  3, 11,  6,  8,  0,  7,  9,  2,  4, 10,  5])

In [27]:
df.take(sampler[:5])

    age sex         bins
1    22   M        youth
3    27   M  young_adult
11   32   M  young_adult
6    37   F   middle_age
8    61   F       senior

In [28]:
################ group_by ####################

df.groupby("bins").get_group("youth")

   age sex   bins
0   20   F  youth
1   22   M  youth
2   25   M  youth
4   21   F  youth
5   23   M  youth

In [29]:
df.groupby("bins").groups

{'middle_age': Int64Index([6, 9, 10], dtype='int64'),
 'senior': Int64Index([8], dtype='int64'),
 'young_adult': Int64Index([3, 7, 11], dtype='int64'),
 'youth': Int64Index([0, 1, 2, 4, 5], dtype='int64')}

In [30]:
df.groupby("bins").mean()

              age
bins
youth        22.2
young_adult  30.0
middle_age   41.0
senior       61.0

In [31]:
df.groupby("bins").max()

             age sex
bins
youth         25   M
young_adult   32   M
middle_age    45   M
senior        61   F

In [32]:
df.groupby("bins").min()

             age sex
bins
youth         20   F
young_adult   27   M
middle_age    37   F
senior        61   F

In [33]:
df.groupby("bins").count()

             age  sex
bins
youth          5    5
young_adult    3    3
middle_age     3    3
senior         1    1

In [34]:
df.groupby("bins").describe()

              age
            count  mean       std   min   25%   50%   75%   max
bins
youth         5.0  22.2  1.923538  20.0  21.0  22.0  23.0  25.0
young_adult   3.0  30.0  2.645751  27.0  29.0  31.0  31.5  32.0
middle_age    3.0  41.0  4.000000  37.0  39.0  41.0  43.0  45.0
senior        1.0  61.0       NaN  61.0  61.0  61.0  61.0  61.0

In [35]:
df.groupby("bins").size()

bins
youth          5
young_adult    3
middle_age     3
senior         1
dtype: int64

In [36]:
df.groupby("bins").max()

             age sex
bins
youth         25   M
young_adult   32   M
middle_age    45   M
senior        61   F

In [37]:
df.groupby("bins").min()

             age sex
bins
youth         20   F
young_adult   27   M
middle_age    37   F
senior        61   F

In [38]:
################ groupby agg 集約　####################

def diff(group):
    return group.max()-group.min()

def count(group):
    return group.count()

df.groupby("bins")["age"].agg([diff,count])

             diff  count
bins
youth           5      5
young_adult     5      3
middle_age      8      3
senior          0      1

In [39]:
df["age2"] =df["age"]*2
df.groupby("bins").agg({"age":np.mean,"age2":np.sum})

              age  age2
bins
youth        22.2   222
young_adult  30.0   180
middle_age   41.0   246
senior       61.0   122

In [40]:
################ groupby transform　　####################

def zscore(x):
    zscore = (x-x.mean())/x.std()
    return zscore

df.groupby("bins").transform(lambda x: zscore(x))

         age      age2
0  -1.143726 -1.143726
1  -0.103975 -0.103975
2   1.455651  1.455651
3  -1.133893 -1.133893
4  -0.623850 -0.623850
5   0.415900  0.415900
6  -1.000000 -1.000000
7   0.377964  0.377964
8        NaN       NaN
9   1.000000  1.000000
10  0.000000  0.000000
11  0.755929  0.755929

In [41]:
df.groupby("bins")["age"].apply(lambda x:np.max(x)-np.min(x))

bins
youth          5
young_adult    5
middle_age     8
senior         0
Name: age, dtype: int64

In [42]:
################ groupby filter　　####################
df.take(df.groupby("bins")["age"].filter(lambda x:np.max(x)-np.min(x)==5).index)

    age sex         bins  age2
0    20   F        youth    40
1    22   M        youth    44
2    25   M        youth    50
3    27   M  young_adult    54
4    21   F        youth    42
5    23   M        youth    46
7    31   M  young_adult    62
11   32   M  young_adult    64

In [43]:
################ groupby agg　　####################
df  = sns.load_dataset("iris")
df.groupby("species").agg([np.max,np.min])

           sepal_length      sepal_width      petal_length      petal_width  \
                   amax amin        amax amin         amax amin        amax
species
setosa              5.8  4.3         4.4  2.3          1.9  1.0         0.6
versicolor          7.0  4.9         3.4  2.0          5.1  3.0         1.8
virginica           7.9  4.9         3.8  2.2          6.9  4.5         2.5


           amin
species
setosa      0.1
versicolor  1.0
virginica   1.4

In [44]:
################ str split extend list　####################

s_org = pd.Series(['aaa@xxx.com', 'bbb@yyy.com', 'ccc@zzz.com', 'ddd'], index=['A', 'B', 'C', 'D'])
print(s_org)
print(type(s_org))

A    aaa@xxx.com
B    bbb@yyy.com
C    ccc@zzz.com
D            ddd
dtype: object
<class 'pandas.core.series.Series'>

In [45]:
s_org.str.split("@")

A    [aaa, xxx.com]
B    [bbb, yyy.com]
C    [ccc, zzz.com]
D             [ddd]
dtype: object

In [46]:
s_org.str.split("@",expand=True).stack()

A  0        aaa
   1    xxx.com
B  0        bbb
   1    yyy.com
C  0        ccc
   1    zzz.com
D  0        ddd
dtype: object

A  0        aaa
   1    xxx.com
B  0        bbb
   1    yyy.com
C  0        ccc
   1    zzz.com
D  0        ddd
dtype: object